Merge pull request #2 from itsnyxdev/main
docs: update and restructure contributing guide
